[Play_X2_XP_TYG_1st_Stronghold_Capacitor_Damaged AkEvent]
SpokenText="Energy levels within the capacitor are fluctuating wildly. I believe our assault is having the desired effect."

[Play_X2_XP_TYG_1st_Stronghold_Monolith_Damaged_Only AkEvent]
SpokenText="Yes, the regeneration process has been interrupted. Readings on the capacitor indicate it has become highly unstable."

[Play_X2_XP_TYG_2nd_Stronghold_Capacitor_Damaged AkEvent]
SpokenText="My latest readings indicate the capacitor is weakening. I do not believe it can withstand another significant assault."

[Play_X2_XP_TYG_2nd_Stronghold_Monolith_Damaged_Only AkEvent]
SpokenText="We have successfully disrupted the regeneration process. I do not believe the capacitor will be of concern again."

[Play_X2_XP_TYG_3rd_Stronghold_Capacitor_Damaged AkEvent]
SpokenText="The capacitor is struggling to maintain consistent energy levels. We are getting close to disrupting it completely."

[Play_X2_XP_TYG_3rd_Stronghold_Monolith_Damaged_Only AkEvent]
SpokenText="With the capacitor damaged the regeneration process has been interrupted. I believe now would be the appropriate time to "take them out.""

[Play_X2_XP_TYG_Destroy_Monolith_Nag AkEvent]
SpokenText="With the amount of energy housed in that capacitor, I fear the Chosen could continue the regeneration process indefinitely. I do not believe we can simply wear them down."

[Play_X2_XP_TYG_T_1st_Stronghold_First_Chosen_False_Death AkEvent]
SpokenText="The device appears to be some sort of psionic capacitor transferring tremendous amounts of psionic energy directly to the Chosen. Restoring them!"

[Play_X2_XP_TYG_T_1st_Stronghold_Mission_Intro AkEvent]
SpokenText="Detecting a strong energy signature further ahead in the facility. There's no doubt in my mind that it is from the Chosen."

[Play_X2_XP_TYG_T_1st_Stronghold_Teleporter_Sighted AkEvent]
SpokenText="Energy signature directly ahead. This appears to be an alien transport device of some kind."

[Play_X2_XP_TYG_T_2nd_Stronghold_First_Chosen_False_Death AkEvent]
SpokenText="It appears this device functions in a similar fashion to the capacitor we encountered previously. I recommend haste in disabling its prime mechanism to prevent the Chosen from regenerating indefinitely."

[Play_X2_XP_TYG_T_2nd_Stronghold_Mission_Intro AkEvent]
SpokenText="Locking on to the Chosen's energy signature. Uploading coordinates now."

[Play_X2_XP_TYG_T_2nd_Stronghold_Teleporter_Sighted AkEvent]
SpokenText="Transport portal directly ahead. Updating coordinates now."

[Play_X2_XP_TYG_T_3rd_Stronghold_First_Chosen_False_Death AkEvent]
SpokenText="An accurate assessment."

[Play_X2_XP_TYG_T_3rd_Stronghold_Mission_Intro AkEvent]
SpokenText="Central, the power signature for the transport device is coming in clearer than ever before. It's almost as if they want us to see it."

[Play_X2_XP_TYG_T_3rd_Stronghold_Teleporter_Sighted AkEvent]
SpokenText="Readings on the portal are stronger than ever. Our team is close."

[Play_X2_XP_TYG_T_Destroy_Monolith_Callout AkEvent]
SpokenText="Central, while the regenerative barrier surrounding the Chosen appears to be impenetrable, the same cannot be said for the capacitor. The transference process is draining it. I believe it may be vulnerable if only for a moment."

[Play_X2_XP_TYG_T_First_Seen_Adv_Priest_M1 AkEvent]
SpokenText="It would seem ADVENT has begun deploying their so-called "Priests" into combat. Their implants provide significant enhancements to whatever latent Psionic energy they may have once possessed."

[Play_X2_XP_TYG_T_First_Seen_Lost_2 AkEvent]
SpokenText="It appears the alien devices dropped during the First Invasion had a degenerative effect on these citizens, causing their physical and mental health to rapidly decay while maintaining primitive organic functions. Approach with caution, Commander. They are certainly dangerous."

[Play_X2_XP_TYG_T_First_Seen_Spectre_M1 AkEvent]
SpokenText="What would appear to be a single entity is actually a swarm of of tiny, robotic units working in close coordination to maintain a cohesive form."

[Play_X2_XP_TYG_T_First_Spectre_Sighted AkEvent]
SpokenText="Although it would appear to be humanoid in form, this entity is nearly invisible to our sensors. Had I not seen it myself, I would question its very existence."

[Play_X2_XP_TYG_T_LNA_Part1_Lost_Combat_Eight_1 AkEvent]
SpokenText="Though their intelligence appears almost non-existent, these creatures seem to employ some sort of rudimentary communication system. Perhaps auditory signals or some form of hive-like consciousness."

[Play_X2_XP_TYG_T_LNA_Part1_Lost_Combat_Eight_2 AkEvent]
SpokenText="The entire swarm knows there is "food" here now. I would advise we make haste to leave this area."

[Play_X2_XP_TYG_T_LNA_Part1_Lost_Combat_Nine_1 AkEvent]
SpokenText="Central, the preliminary readings from these creatures seem familiar. I will need to consult my records, but I may have encountered something similar to them during my time with ADVENT."

[Play_X2_XP_TYG_T_LNA_Part1_Lost_Combat_One_1 AkEvent]
SpokenText="These creatures' DNA has mutated well beyond what we would classify as human. Perhaps the result of long term exposure to the alien radiation from those pods. Though why anyone would subject themselves to that, I cannot imagine."

[Play_X2_XP_TYG_T_LNA_Part1_Lost_Combat_Six_1 AkEvent]
SpokenText="Central, biological signatures are grouping into a singular mass, one closing in on this position."

[Play_X2_XP_TYG_T_LNA_Part1_LostGone_NoEscape_1 AkEvent]
SpokenText="Biological readings in your general area are clear. No more creatures on approach."

[Play_X2_XP_TYG_T_LNA_Part1_Post_Fog_Pod_1 AkEvent]
SpokenText="Damaged and dormant all these years, these devices still emit trace elements of unstable radiation. I cannot fathom what they were like in their original function."

[Play_X2_XP_TYG_T_LNA_Part1_Unit_Two_Exits AkEvent]
SpokenText="I would advise haste Central. Readings indicate a large bio-mass en route."

[Play_X2_XP_TYG_T_LNA_Part2_Dasher_Callout_1 AkEvent]
SpokenText="An apt description. It would seem the mutation has somehow accelerated these Dashers' metabolism, allowing enhanced speed and agility with a corresponding increase in aggression."

[Play_X2_XP_TYG_T_LNA_Part2_Lost_Counter_Four_1 AkEvent]
SpokenText="The shock wave of that explosion reverberated throughout most of the city. I would expect a significant reaction from the Lost."

[Play_X2_XP_TYG_T_LNA_Part2_Post_Big_Bang_1 AkEvent]
SpokenText="I fear that is not the worst of it. Multiple biological signatures rapidly on approach to your position."

[Play_X2_XP_TYG_T_LNA_Part2_Pre_Purifier_Reveal_1 AkEvent]
SpokenText="Central, detecting additional biological signatures ahead."

[Play_X2_XP_TYG_T_LNA_Part2_Pre_Purifier_Reveal_2 AkEvent]
SpokenText="No, these appear to be more familiar."

[Play_X2_XP_TYG_T_LNA_Part2_Purifier_Weapon_Info_1 AkEvent]
SpokenText="The concentrated plasma fire emitted from the Purifier's dispersal units appears capable of liquefying more than just organic matter. Stone, metals, even the alloys used in our armor are all susceptible. A brutal yet effective means of "purification.""

[Play_X2_XP_TYG_T_LNA_Part3_Lost_Reinforcement_1 AkEvent]
SpokenText="The sonic dispersal waves emitting from that pod are crisscrossing a massive area."

[Play_X2_XP_TYG_T_LNA_Part3_Lost_Reinforcement_2 AkEvent]
SpokenText="An accurate assessment. The entire Lost biomass seems to be converging on this position."

[Play_X2_XP_TYG_T_LNA_Plasma_Purifiers_1 AkEvent]
SpokenText="The concentrated plasma fire emitted from these Purifier's dispersal units appears capable of liquefying more than just organic matter. Stone, metals, even the alloys used in our armor are all susceptible. A brutal yet effective means of "purification"."

[Play_X2_XP_TYG_T_LNA_Play3_Assassin_Teleport_1 AkEvent]
SpokenText="Negative, scanners at maximum intensity, but it appears as if she has disappeared."

[Play_X2_XP_TYG_T_LNA_Play3_Lost_Battle_Five_1 AkEvent]
SpokenText="Detecting additional Lost converging near the evacuation coordinates. I advise caution, it would seem the Lost are on to our strategy."

[Play_X2_XP_TYG_T_LNA_Play3_Lost_Battle_One AkEvent]
SpokenText="Initial analysis of these creatures' movement patterns reveals an almost coordinated attack strategy. Perhaps they are not the mindless automatons they initially appear to be. An intriguing, if not horrific possibility."

[Play_X2_XP_TYG_T_LNA_Play3_Lost_Battle_Seven_1 AkEvent]
SpokenText="Central, the sheer magnitude of the biomass converging upon this position is...staggering. If our team does not evacuate now..."

[Play_X2_XP_TYG_T_Sabotage_Trans_Relay_Destroyed AkEvent]
SpokenText="Well done, as we had hoped the network separation has been temporarily delayed."

[Play_X2_XP_TYG_T_Sabotage_Trans_Relay_Spotted AkEvent]
SpokenText="Our readings indicate that relay is feeding energy directly into their network. If you can destroy it, it may disrupt their efforts to isolate the transmitter."

[Play_X2_XP_TYG_T_SITREP_Chemical_Leak AkEvent]
SpokenText="I'm detecting high concentrations of a particularly nasty compound spreading throughout that area. I would strongly advise our forces to avoid direct contact."

[Play_X2_XP_TYG_T_SITREP_Outbreak AkEvent]
SpokenText="As I expected, Commander, there are significant readings indicative of the Lost moving throughout the combat zone. Be careful out there."

[Play_X2_XP_TYG_T_SITREP_Psionic_Storm AkEvent]
SpokenText="As I expected, the Psionic readings we detected in this area can be attributed to a number of Psionically-powerful aliens near our position. I would urge caution, Commander."

[Play_X2_XP_TYG_T_SITREP_Savage AkEvent]
SpokenText="Our initial readings were correct, Commander. The aliens have clearly unleashed their most unrestrained subjects on this area."

[Play_X2_XP_TYG_CIN_LA_Reaper_Reveal_2 AkEvent]
SpokenText="Detecting increasing biological signatures in the area ahead."

